tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mutagen-io/mutagen"
tap "stripe/stripe-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Libraries for security-enabled client and server applications
brew "nss"
# General-purpose scripting language
brew "php@7.2", link: true
# Object-relational database system
brew "postgresql"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# App to build and share containerized applications and microservices
cask "docker"
# Virtualizer for x86 hardware
cask "virtualbox"
cask "firefox"
cask "google-chrome"
cask "google-backup-and-sync"
cask "slack"
cask "insomnia"
cask "iterm2"
cask "visual-studio-code"
cask "postgres"
